In [1]:
import numpy as np

In [2]:
my_arr = np.arange(1_000_000)
my_list = list(range(1_000_000))

In [5]:
%timeit my_arr2 = my_arr * 2

1.07 ms ± 2.1 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [4]:
 %timeit my_list2 = [x * 2 for x in my_list]

71.1 ms ± 896 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [6]:
a = np.array([[1, 2, 3],[4,5,6],[7,8,9]])

a[:, 1]

array([2, 5, 8])

In [7]:
a[:, :1]

array([[1],
       [4],
       [7]])

In [9]:
rng = np.random.default_rng(seed=12345)
ata = rng.standard_normal((2, 3))
print(ata)

[[-1.42382504  1.26372846 -0.87066174]
 [-0.25917323 -0.07534331 -0.74088465]]

In [11]:
rng = np.random.default_rng(seed=42)
bta = rng.standard_normal((2, 3))
print(bta)

[[ 0.30471708 -1.03998411  0.7504512 ]
 [ 0.94056472 -1.95103519 -1.30217951]]

In [12]:
points = np.arange(-5, 5, 0.01)
xs, ys = np.meshgrid(points, points)
xs

array([[-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       ...,
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99]])

In [15]:
ys

array([[-5.  , -5.  , -5.  , ..., -5.  , -5.  , -5.  ],
       [-4.99, -4.99, -4.99, ..., -4.99, -4.99, -4.99],
       [-4.98, -4.98, -4.98, ..., -4.98, -4.98, -4.98],
       ...,
       [ 4.97,  4.97,  4.97, ...,  4.97,  4.97,  4.97],
       [ 4.98,  4.98,  4.98, ...,  4.98,  4.98,  4.98],
       [ 4.99,  4.99,  4.99, ...,  4.99,  4.99,  4.99]])

In [16]:
xs==ys

array([[ True, False, False, ..., False, False, False],
       [False,  True, False, ..., False, False, False],
       [False, False,  True, ..., False, False, False],
       ...,
       [False, False, False, ...,  True, False, False],
       [False, False, False, ..., False,  True, False],
       [False, False, False, ..., False, False,  True]])

In [ ]:
#3 indexing and slicing
#--- that is the way you select element(s) from an array.
#--- select just one element a[i]; a[i][j]; a[i,j] 
#--- select multiple elements
#------in a continuous range of indices: slicing (working on views)
#------not in a continuous range of indices (creating a new array): (1) boolean indexing and (2) integer array indexing.


a = np.array([[1,2,3],[4,5,6], [7, 8, 9]])
rows = [0,2]
b = a[rows]
print(b)

b1 = a[[i for i in range(3) if (a[i] == 5).sum() > 0]]
print("b1", b1)

b2 = a[[i for i in range(a.shape[0]) if i % 2 == 0]]
print(b2)

print(1)
print(a[0][:2])
print(2)
print(a[1])
print(3)
print(4)
print(a[1:][:,1])
print(5)
print(a[1:][:,1:])


size = (2, 3)
zeros = np.zeros(size)
print("zeros", zeros)

ones = np.ones(size)
print("ones", ones)

empty = np.empty(size)
print("empty", empty)

eyes = np.eye(3, 3, dtype = int)
print("eyes ", eyes)

ones = np.reshape(ones, (3,2))
print("ones", ones)

In [3]:
import pandas as pd
a = pd.Series([1, 2, 3, 4, 5])
print(a)
b = a > 3
print(b)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    False
1    False
2    False
3     True
4     True
dtype: bool

In [29]:
obj2 = pd.Series([4, 7, -5, 3], index=[("apple", "count"), "b", "a", "c"])
print(obj2[:2])
obj2['d'] = 5
obj2['a'] = 10000
obj2[0] = 22222
print(obj2)
obj2[:2] = '2a'
print(obj2)

(apple, count)    4
b                 7
dtype: int64
(apple, count)    22222
b                     7
a                 10000
c                     3
d                     5
dtype: int64
(apple, count)       2a
b                    2a
a                 10000
c                     3
d                     5
dtype: object

In [23]:
obj3 = pd.Series({'a': 11, 'b':22, 'c':33})
print(obj3[:2])

a    11
b    22
dtype: int64

In [8]:
print (obj3.index)
print(obj3.array)

Index(['a', 'b', 'c'], dtype='object')
<PandasArray>
[11, 22, 33]
Length: 3, dtype: int64

In [11]:
d = {1: 'aa', 3: 'bb', 5: 'cc', 2: 'aaa', 4: 'bbb', 6: 'ccc', 8: 'ddd'}
ind = [1, 2, 3, 4, 5]
s = pd.Series(data = d, index = ind )
print(s)

1     aa
2    aaa
3     bb
4    bbb
5     cc
dtype: object

In [12]:
s.index = [11, 22, 33, 44, 55]
print(s)

11     aa
22    aaa
33     bb
44    bbb
55     cc
dtype: object

In [18]:
data = {'colA': ['a', 'aa', 'aaa', 'aaaa', '5a'],
       'colB': ['b', 'bb', 'bbb', 'bbbb', 'bbbbb'],
       'col10s': [11, 22, 33, 44, 55]}

df1 = pd.DataFrame(data = data, columns = ['colA', 'colB', 'col10s'])
df1

   colA   colB  col10s
0     a      b      11
1    aa     bb      22
2   aaa    bbb      33
3  aaaa   bbbb      44
4    5a  bbbbb      55

In [30]:
colA = df1['colA']
print(colA)

0       a
1      aa
2     aaa
3    aaaa
4      5a
Name: colA, dtype: object

In [32]:
colA[0] = '100a'
print(colA)
df1

0    100a
1      aa
2     aaa
3    aaaa
4      5a
Name: colA, dtype: object

/tmp/ipykernel_67658/3557986353.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  colA[0] = '100a'

   colA   colB  col10s
0  100a      b      11
1    aa     bb      22
2   aaa    bbb      33
3  aaaa   bbbb      44
4    5a  bbbbb      55

In [38]:
colAB = df1[['colA', 'colB']]

colAB.loc[0][0] = "1000A"
df1

   colA   colB  col10s
0  100a      b      11
1    aa     bb      22
2   aaa    bbb      33
3  aaaa   bbbb      44
4    5a  bbbbb      55

In [39]:
colAB

    colA   colB
0  1000A      b
1     aa     bb
2    aaa    bbb
3   aaaa   bbbb
4     5a  bbbbb

In [43]:
#del df1['colA']
df1.drop(axis = 1, columns = ['colB'], inplace = True)
df1

   col10s
0      11
1      22
2      33
3      44
4      55

In [48]:
colA = ['1a', '2a', '3a', '4a', '5a']
#df1.insert(loc = 0, column = 'colA', value = colA)

colB = pd.Series([1, 2, 3,4,5])
df1.insert(loc = 2, column = 'colB', value = colB)
df1

  colA  col10s  colB
0   1a      11     1
1   2a      22     2
2   3a      33     3
3   4a      44     4
4   5a      55     5

In [50]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [54]:
df2 = pd.DataFrame(df1, index = pd.Index([1,'b','c','d','e']))
df2

  colA  col10s  colB
1   2a    22.0   2.0
b  NaN     NaN   NaN
c  NaN     NaN   NaN
d  NaN     NaN   NaN
e  NaN     NaN   NaN

In [53]:
df1

  colA  col10s  colB
0   1a      11     1
1   2a      22     2
2   3a      33     3
3   4a      44     4
4   5a      55     5

In [55]:
df1.loc[2]

colA      3a
col10s    33
colB       3
Name: 2, dtype: object

In [56]:
df1.loc[2] = [1, 2, 3]
df1

  colA  col10s  colB
0   1a      11     1
1   2a      22     2
2    1       2     3
3   4a      44     4
4   5a      55     5

In [57]:
df1.iloc[2] = [11, 22, 33]
df1

  colA  col10s  colB
0   1a      11     1
1   2a      22     2
2   11      22    33
3   4a      44     4
4   5a      55     5

In [58]:
df1.loc[:2]

  colA  col10s  colB
0   1a      11     1
1   2a      22     2
2   11      22    33

In [59]:
df1.iloc[:2]

  colA  col10s  colB
0   1a      11     1
1   2a      22     2

In [1]:
import pandas as pd
df = pd.DataFrame({"col1": [1, 11, 111, 1, 1], 
                  "col2": [2,22, 222, 2, 2] })

df

   col1  col2
0     1     2
1    11    22
2   111   222
3     1     2
4     1     2

In [10]:
#replace the col2 with {2 -> 3; 22 -> 33}

df.col2 = df.col2.replace({2: 3, 22: 33})
df

   col1  col2
0     1     3
1    11    33
2   111   222
3     1     3
4     1     3